In [2]:
import pandas as pd
import numpy as np

frame = pd.DataFrame(np.random.randn(4,3),
                    columns=list('bde'),
                    index=['台北','台中','台南','高雄'])
frame

           b         d         e
台北 -0.545793  0.423512 -0.772525
台中 -1.831410  1.412941  0.921428
台南  0.382137 -0.357315 -1.048640
高雄 -1.896028 -0.767116 -1.083698

In [3]:
np.abs(frame) #numpy的運算也可以用在pandas

           b         d         e
台北  0.545793  0.423512  0.772525
台中  1.831410  1.412941  0.921428
台南  0.382137  0.357315  1.048640
高雄  1.896028  0.767116  1.083698

In [4]:
frame

           b         d         e
台北 -0.545793  0.423512 -0.772525
台中 -1.831410  1.412941  0.921428
台南  0.382137 -0.357315 -1.048640
高雄 -1.896028 -0.767116 -1.083698

In [5]:
#自訂function
def subValue(x):
    return x.max()-x.min()

frame.apply(subValue)

b    2.278165
d    2.180056
e    2.005126
dtype: float64

In [6]:
#暱名function lambda
frame.apply(lambda x: x.max() - x.min())

b    2.278165
d    2.180056
e    2.005126
dtype: float64

In [7]:
frame.apply(lambda x: x.max() - x.min(), axis=1)

台北    1.196037
台中    3.244351
台南    1.430777
高雄    1.128912
dtype: float64

In [8]:
def subValue1(x):
    return pd.Series([x.min(), x.max()], index=['min','max'])
frame.apply(subValue1)

            b         d         e
min -1.896028 -0.767116 -1.083698
max  0.382137  1.412941  0.921428

In [12]:
frame.apply(subValue1,axis=1).T

           台北        台中        台南        高雄
min -0.772525 -1.831410 -1.048640 -1.896028
max  0.423512  1.412941  0.382137 -0.767116

In [18]:
def subValue2(x):
    return float("{:.2f}".format(x))
frame.applymap(subValue2)

       b     d     e
台北 -0.55  0.42 -0.77
台中 -1.83  1.41  0.92
台南  0.38 -0.36 -1.05
高雄 -1.90 -0.77 -1.08

In [19]:
frame.applymap(lambda x:float("{:.2f}".format(x)))

       b     d     e
台北 -0.55  0.42 -0.77
台中 -1.83  1.41  0.92
台南  0.38 -0.36 -1.05
高雄 -1.90 -0.77 -1.08

In [20]:
frame

           b         d         e
台北 -0.545793  0.423512 -0.772525
台中 -1.831410  1.412941  0.921428
台南  0.382137 -0.357315 -1.048640
高雄 -1.896028 -0.767116 -1.083698

In [31]:
newFrame = frame['b'].map(lambda x: float("{:.2f}".format(x)))
newFrame.sum()

-3.9

In [32]:
df = pd.DataFrame([[1.4, np.nan],
                  [7.1, -4.5],
                  [np.nan, np.nan],
                  [0.75, -1.3]],
                 index=['a', 'b', 'c', 'd'],
                 columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [33]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [34]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [36]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [37]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [38]:
s1 = pd.Series([0, 5, 9, 14])
s1.mean()

7.0

In [40]:
s2 = pd.Series([5, 6, 8, 9])
s2.mean()

7.0

In [41]:
s1.std()

5.94418483337567

In [42]:
s2.std()

1.8257418583505538